{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "image_input"}, "inbound_nodes": [], "name": "image_input"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, null, null], "sparse": false, "input_dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block1_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"name": "block1_pool", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block1_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block2_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"name": "block2_pool", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block2_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv3", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"name": "block3_pool", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block3_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv3", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"name": "block4_pool", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block4_pool"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv1", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv2", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv3", "activity_regularizer": null, "trainable": false, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "same"}, "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"name": "block5_pool", "trainable": false, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "block5_pool"}], "input_layers": [["input_2", 0, 0]], "name": "vgg16", "output_layers": [["block5_pool", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0]]], "name": "vgg16"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["vgg16", 1, 0]]], "name": "flatten"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 25088, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 4096}, "inbound_nodes": [[["flatten", 0, 0]]], "name": "fc1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4096, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 4096}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "fc2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "predictions", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4096, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 8}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "predictions"}], "input_layers": [["image_input", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_2"}}